/*
Создать массив типа double с размером 4.
Записать в него любые значения с помощью блока для инициализации.
 Вывести на консоль значение первого элемента.
 */
package lesson6;

public class DoubleArray {
    public static void main( String[] args ) {

                int[] weekDays = { 1, 2, 3, 4, 5, 6, 7};
                System.out.println("Понедельник " + weekDays[0] + "й день в недели.");
    }
}

